In [19]:
import pandas as pd

In [20]:
record1 = pd.Series({'Name':'Alice',
                    'score':85})

In [21]:
record2 = pd.Series({'Name':'Jack',
                    'score':82})

In [22]:
record3 = pd.Series({'Name':'Helen',
                    'score':90})

In [23]:
df = pd.DataFrame([record1, record2, record3],
                 index = ['school1','school2','school1'])

In [24]:
df.head()

          Name  score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [26]:
students = [{'Name':'Alice',
            'score':85},
           {'Name':'Jack',
            'score':82},
           {'Name':'Helen',
            'score':90}]

In [27]:
df = pd.DataFrame(students, index=['school1','school2','school1'])

In [28]:
df.head()

          Name  score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [29]:
df.loc['school2']

Name     Jack
score      82
Name: school2, dtype: object

In [30]:
type(df.loc['school2'])

pandas.core.series.Series

In [31]:
df.loc['school1']

          Name  score
school1  Alice     85
school1  Helen     90

In [32]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [33]:
df.loc['school1','Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [34]:
df.T

      school1 school2 school1
Name    Alice    Jack   Helen
score      85      82      90

In [35]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [36]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [41]:
copy_df=df.copy()

In [44]:
del copy_df['Name']

In [46]:
copy_df

         score
school1     85
school2     82
school1     90

In [47]:
df['classrank']=None

In [48]:
df

          Name  score classrank
school1  Alice     85      None
school2   Jack     82      None
school1  Helen     90      None

Indexing and Loading

In [49]:
import pandas as pd

In [50]:
df = pd.read_csv('Admission_Predict.csv')

In [51]:
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [52]:
df = pd.read_csv('Admission_Predict.csv',index_col=0)

In [53]:
df.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [56]:
new_df = df.rename(columns={'GRE Score':'Gre_Score','SOP':'Statement of Purpose','LOR':'Letter of Recommendation'})

In [57]:
new_df.head()

,Gre_Score,TOEFL Score,University Rating,Statement of Purpose,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [58]:
new_df.columns

Index(['Gre_Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'LOR ', 'CGPA', 'Research', 'Chance of Admit '],
      dtype='object')

In [59]:
new_df=new_df.rename(columns={'LOR ':'Letter of Recommendation'})

In [60]:
new_df.head()

,Gre_Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [61]:
new_df = new_df.rename(mapper=str.strip, axis='columns')

In [62]:
new_df.head()

,Gre_Score,TOEFL Score,University Rating,Statement of Purpose,Letter of Recommendation,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [63]:
new_df.columns

Index(['Gre_Score', 'TOEFL Score', 'University Rating', 'Statement of Purpose',
       'Letter of Recommendation', 'CGPA', 'Research', 'Chance of Admit'],
      dtype='object')

In [64]:
cols = list(df.columns)

In [65]:
cols

['GRE Score',
 'TOEFL Score',
 'University Rating',
 'SOP',
 'LOR ',
 'CGPA',
 'Research',
 'Chance of Admit ']

In [66]:
cols=[x.lower().strip() for x in cols]

In [67]:
cols

['gre score',
 'toefl score',
 'university rating',
 'sop',
 'lor',
 'cgpa',
 'research',
 'chance of admit']

In [ ]:
df.columns